## First import the dataset of the marine mammal distrubutions

In [1]:
import pandas as pd
import seaborn as sns
import numpy as np 
url = 'https://raw.githubusercontent.com/yveness7/Marine_Mammals_vs_Climate_Change_mid_term_project/main/mammals%20data/editMMSDB_observations_1995-2016.xlsx_0%20(copy).csv'
df = pd.read_csv(url)
df

,Date,Latitude,Longitude,Location,Species,Adult M,Adult F,Adult,Subadult,Polar bear condition,Polar bear den,Cub/calf/pup,Bear cubs,Dead/alive,Unidentified,Total,Habitat,Occurrence remark
0,2000-07-29,78.55,25.416667,Unknown,balaena mysticetus,,,,,,,,,,,1,water,V. Large individual possibly a F
1,2000-08-08,79.1166666666667,21.441667,Unknown,balaena mysticetus,,,,,,,,,,,1,water,
2,2000-08-16,78.917,24.050000,Unknown,balaena mysticetus,,,,,,,,,,,1,water,
3,2001-08-08,79.268,20.858000,Unknown,balaena mysticetus,,,,,,,,,,,1,water,
4,2005-08-06,78.932,11.922000,Nye Ålesund,balaena mysticetus,,,,,,,,,,,1,water,
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
17370,2006-07-25,80.703,20.883000,Phippsøya,ursus maritimus,,,,,,,,,,,19,land,Feeding on whale carcass
17371,2010-09-21,80.1107,28.079700,Storøya,ursus maritimus,,5,,,,,7,,,,20,unknown,"Two females with yearlings, two females with ..."
17372,2012-07-11,79.01,20.500000,Hochstetterbreen,ursus maritimus,,2,,,,,3,,,,22,ice,
17373,2015-08-28,78.9354,28.635900,Kongsøya,ursus maritimus,0,5,18,7,0,,0,0,,0,30,land,Hele øya
17374,2004-09-01,79.869,27.179000,Italianeset,ursus maritimus,,,31,,,,1,,,,32,land,spread around island

## View the columns

In [2]:
df.columns

Index([' Date ', ' Latitude ', ' Longitude ', ' Location ', ' Species ',
       ' Adult M ', ' Adult F ', ' Adult ', ' Subadult ',
       ' Polar bear condition ', ' Polar bear den ', ' Cub/calf/pup ',
       ' Bear cubs ', ' Dead/alive ', ' Unidentified ', ' Total ', ' Habitat ',
       ' Occurrence remark '],
      dtype='object')

## Get spaces out of the column names

In [3]:

df.rename(columns=lambda x: x.strip(), inplace=True)
df.columns

Index(['Date', 'Latitude', 'Longitude', 'Location', 'Species', 'Adult M',
       'Adult F', 'Adult', 'Subadult', 'Polar bear condition',
       'Polar bear den', 'Cub/calf/pup', 'Bear cubs', 'Dead/alive',
       'Unidentified', 'Total', 'Habitat', 'Occurrence remark'],
      dtype='object')

## Change names to lower case

In [4]:
df.rename(columns=lambda x: x.lower(), inplace=True)
df.columns

Index(['date', 'latitude', 'longitude', 'location', 'species', 'adult m',
       'adult f', 'adult', 'subadult', 'polar bear condition',
       'polar bear den', 'cub/calf/pup', 'bear cubs', 'dead/alive',
       'unidentified', 'total', 'habitat', 'occurrence remark'],
      dtype='object')

## View the column 'species'

In [5]:
df.species.unique()

array([' balaena mysticetus ', ' balaenoptera acutorostrata ',
       ' balaenoptera borealis ', ' balaenoptera musculus ',
       ' balaenoptera physalus ', ' cystophora cristata ',
       ' delphinapterus leucas ', ' erignathus barbatus ',
       ' globicephala melas ', ' hyperoodon ampullatus ',
       ' lagenorhynchus albirostris ', ' megaptera novaeangliae ',
       ' monodon monoceros ', ' odobenus rosmarus ', ' orcinus orca ',
       ' phoca groenlandica ', ' phoca vitulina ',
       ' physeter macrocephalus ', ' pusa hispida ', ' ursus maritimus '],
      dtype=object)

## Remove the spaces before and after the scientific names

In [6]:
df['species'] = df['species'].str.strip()
df.species.unique()

array(['balaena mysticetus', 'balaenoptera acutorostrata',
       'balaenoptera borealis', 'balaenoptera musculus',
       'balaenoptera physalus', 'cystophora cristata',
       'delphinapterus leucas', 'erignathus barbatus',
       'globicephala melas', 'hyperoodon ampullatus',
       'lagenorhynchus albirostris', 'megaptera novaeangliae',
       'monodon monoceros', 'odobenus rosmarus', 'orcinus orca',
       'phoca groenlandica', 'phoca vitulina', 'physeter macrocephalus',
       'pusa hispida', 'ursus maritimus'], dtype=object)

## View how many we got from each species

In [7]:
df['species'].value_counts()

ursus maritimus               3558
odobenus rosmarus             2497
balaenoptera acutorostrata    2233
balaenoptera physalus         1632
erignathus barbatus           1386
megaptera novaeangliae        1088
phoca groenlandica            1073
lagenorhynchus albirostris    1014
pusa hispida                   885
phoca vitulina                 437
cystophora cristata            407
delphinapterus leucas          386
balaenoptera musculus          332
physeter macrocephalus         160
balaena mysticetus              85
orcinus orca                    66
hyperoodon ampullatus           49
monodon monoceros               40
balaenoptera borealis           35
globicephala melas              12
Name: species, dtype: int64

## Rename the species to their common names

In [8]:
df['species'] = df['species'].replace({'ursus maritimus': 'polar bear',
                                       'odobenus rosmarus':'walrus',
                                      'balaenoptera acutorostrata': 'common minkie whale',
                                       'balaenoptera physalus':'fin whale',
                                       'erignathus barbatus':'bearded seal',
                                       'megaptera novaeangliae':'humpback whale',
                                       'phoca groenlandica':'harp seal',
                                       'lagenorhynchus albirostris':'white beaked dolphin',
                                       'pusa hispida':'ringed seal',
                                       'phoca vitulina':'harbor seal',
                                       'cystophora cristata':'hooded seal',
                                       'delphinapterus leucas':'beluga whale',
                                       'balaenoptera musculus':'blue whale',
                                       'physeter macrocephalus':'sperm whale',
                                       'balaena mysticetus':'bowhead whale',
                                       'orcinus orca':'orca',
                                        'hyperoodon ampullatus':'northern bottlenose whale',
                                       'monodon monoceros':'narwhal',
                                       'balaenoptera borealis':'sei whale',
                                       'globicephala melas':'long-finned pilot whale' })

## View the common names to check if everything is alright

In [9]:
df.species.unique()

array(['bowhead whale', 'common minkie whale', 'sei whale', 'blue whale',
       'fin whale', 'hooded seal', 'beluga whale', 'bearded seal',
       'long-finned pilot whale', 'northern bottlenose whale',
       'white beaked dolphin', 'humpback whale', 'narwhal', 'walrus',
       'orca', 'harp seal', 'harbor seal', 'sperm whale', 'ringed seal',
       'polar bear'], dtype=object)

In [10]:
df['species'].value_counts()

polar bear                   3558
walrus                       2497
common minkie whale          2233
fin whale                    1632
bearded seal                 1386
humpback whale               1088
harp seal                    1073
white beaked dolphin         1014
ringed seal                   885
harbor seal                   437
hooded seal                   407
beluga whale                  386
blue whale                    332
sperm whale                   160
bowhead whale                  85
orca                           66
northern bottlenose whale      49
narwhal                        40
sei whale                      35
long-finned pilot whale        12
Name: species, dtype: int64

## View locations

In [11]:
df.location.unique()

array(['Unknown', ' Nye Ålesund ', ' Fram Strait ', ...,
       ' Freemandsundut ', ' Kapp Hammerfest ', ' Italianeset '],
      dtype=object)

## Replace empty spaces in the names

In [12]:
df['location'] = df['location'].str.strip()
df.location.unique()

array(['Unknown', 'Nye Ålesund', 'Fram Strait', ..., 'Freemandsundut',
       'Kapp Hammerfest', 'Italianeset'], dtype=object)

In [13]:
df.location.value_counts()

Unknown           7544
Poolepynten        189
Moffen             184
ditto              156
Liefdefjorden      141
                  ...
Pyramiden            1
79.27N-019.52E       1
8038N 0172E          1
7857N 01152E         1
Italianeset          1
Name: location, Length: 2608, dtype: int64

## Check unique locations

In [14]:
df.location.nunique() #2608 unique locations

2608

## Check unique date locations

In [15]:
df.date.nunique()

2120

## Check n of unique habitats

In [16]:
df.habitat.nunique()

21

## Lower case and sprip that spaces from the habitats

In [17]:
df['habitat'] = df['habitat'].str.strip()
df['habitat'] = df['habitat'].str.lower()
df.habitat.unique()

array(['water', 'unknown', '', 'ice', 'land', 'ocean', 'at sea',
       'at sea, ice edge', 'glacier ice', 'in hornsund', 'swimming',
       'on land', 'land, water', 'swimming & on ice', 'beach',
       'shore and water', '19.00 martin', 'fast ice', 'pack ice'],
      dtype=object)

In [18]:
#maybe group them a bit better to have less categories, but do we really need them?

## Drop the columns that we are not going to use for the purpose of the analysis

In [19]:
df.columns

Index(['date', 'latitude', 'longitude', 'location', 'species', 'adult m',
       'adult f', 'adult', 'subadult', 'polar bear condition',
       'polar bear den', 'cub/calf/pup', 'bear cubs', 'dead/alive',
       'unidentified', 'total', 'habitat', 'occurrence remark'],
      dtype='object')

In [20]:
df = df.drop(['adult m', 'adult f', 'adult', 'subadult','location',
              'polar bear condition', 'polar bear den', 
              'cub/calf/pup','bear cubs','dead/alive',
             'unidentified','occurrence remark'], axis=1)

In [21]:
df

               date          latitude  longitude        species total  habitat
0       2000-07-29              78.55  25.416667  bowhead whale     1    water
1       2000-08-08   79.1166666666667  21.441667  bowhead whale     1    water
2       2000-08-16             78.917  24.050000  bowhead whale     1    water
3       2001-08-08             79.268  20.858000  bowhead whale     1    water
4       2005-08-06             78.932  11.922000  bowhead whale     1    water
...             ...               ...        ...            ...   ...      ...
17370   2006-07-25             80.703  20.883000     polar bear    19     land
17371   2010-09-21            80.1107  28.079700     polar bear    20  unknown
17372   2012-07-11              79.01  20.500000     polar bear    22      ice
17373   2015-08-28            78.9354  28.635900     polar bear    30     land
17374   2004-09-01             79.869  27.179000     polar bear    32     land

[17375 rows x 6 columns]

In [22]:
df['habitat'].value_counts() #maybe we dont need habitat at all actually

water                5822
unknown              4456
land                 2778
ice                  2533
                     1757
fast ice                5
at sea                  5
pack ice                4
ocean                   4
at sea, ice edge        2
glacier ice             1
swimming                1
on land                 1
land, water             1
swimming & on ice       1
beach                   1
shore and water         1
19.00 martin            1
in hornsund             1
Name: habitat, dtype: int64

## Now we need to fix the location

In [23]:
df['longitude'] = df['longitude'].abs() #We want the absolute values as we have negative values 

df.dtypes #We see that 'latitude' is an object, and we need to turn it into string

date          object
latitude      object
longitude    float64
species       object
total         object
habitat       object
dtype: object

In [24]:
#Upon attempting df['latitude'] = df['latitude'].map(lambda x: float(x)) 
# we get an error that we have a value '79.08046q' and "78-99257" in the column that need to be corrected 
#otherwise we cannot turn the column into float

In [25]:
df['latitude'] = df['latitude'].replace({"79.08046q":"79.08046","78-99257":"7899257"})

In [26]:
df['latitude'] = df['latitude'].map(lambda x: float(x))
df['latitude'] #now we successfully converted the latitude into floats

0        78.550000
1        79.116667
2        78.917000
3        79.268000
4        78.932000
           ...
17370    80.703000
17371    80.110700
17372    79.010000
17373    78.935400
17374    79.869000
Name: latitude, Length: 17375, dtype: float64

In [27]:
df['latitude'] = df['latitude'].abs() #now get the absolute values of latitude to eliminate negative values
df['latitude']

0        78.550000
1        79.116667
2        78.917000
3        79.268000
4        78.932000
           ...
17370    80.703000
17371    80.110700
17372    79.010000
17373    78.935400
17374    79.869000
Name: latitude, Length: 17375, dtype: float64

In [28]:
df['longitude'] #and the longitude is as well successfully converted to floats and abs values

0        25.416667
1        21.441667
2        24.050000
3        20.858000
4        11.922000
           ...
17370    20.883000
17371    28.079700
17372    20.500000
17373    28.635900
17374    27.179000
Name: longitude, Length: 17375, dtype: float64

In [29]:
df

               date   latitude  longitude        species total  habitat
0       2000-07-29   78.550000  25.416667  bowhead whale     1    water
1       2000-08-08   79.116667  21.441667  bowhead whale     1    water
2       2000-08-16   78.917000  24.050000  bowhead whale     1    water
3       2001-08-08   79.268000  20.858000  bowhead whale     1    water
4       2005-08-06   78.932000  11.922000  bowhead whale     1    water
...             ...        ...        ...            ...   ...      ...
17370   2006-07-25   80.703000  20.883000     polar bear    19     land
17371   2010-09-21   80.110700  28.079700     polar bear    20  unknown
17372   2012-07-11   79.010000  20.500000     polar bear    22      ice
17373   2015-08-28   78.935400  28.635900     polar bear    30     land
17374   2004-09-01   79.869000  27.179000     polar bear    32     land

[17375 rows x 6 columns]

## We'll clean the date and we will keep only the years

In [30]:
#We create a for loop that will create a new list and iterate over the values of the column date 

extracted_years = []
for i in df['date']:
    split_year = i.split("-")
    extracted_years.append(int(split_year[0]))  # Convert to int and append


df['year'] = extracted_years
df

               date   latitude  longitude        species total  habitat  year
0       2000-07-29   78.550000  25.416667  bowhead whale     1    water  2000
1       2000-08-08   79.116667  21.441667  bowhead whale     1    water  2000
2       2000-08-16   78.917000  24.050000  bowhead whale     1    water  2000
3       2001-08-08   79.268000  20.858000  bowhead whale     1    water  2001
4       2005-08-06   78.932000  11.922000  bowhead whale     1    water  2005
...             ...        ...        ...            ...   ...      ...   ...
17370   2006-07-25   80.703000  20.883000     polar bear    19     land  2006
17371   2010-09-21   80.110700  28.079700     polar bear    20  unknown  2010
17372   2012-07-11   79.010000  20.500000     polar bear    22      ice  2012
17373   2015-08-28   78.935400  28.635900     polar bear    30     land  2015
17374   2004-09-01   79.869000  27.179000     polar bear    32     land  2004

[17375 rows x 7 columns]

In [ ]:
#At this point we can drop the date and habitat column as we will probably not need them for our analysis

## apply masks on the latitude and longitude

In [ ]:
mask = (df['latitude'] > 35) & (df['longitude'] > 0)

# Apply the mask to the DataFrame
filtered_df = df[mask]

# Display the filtered DataFrame
print(filtered_df)

# Dataframe to CSV for further analysis

In [32]:
df.to_csv('extra_cleaned_marine_mammals.csv')